using System;

internal class Program
{

    /* Створити метод GenArray заповнення масиву випадковими
        числами.В цьому методі створити локальний метод
        обчислення середнього арифметичного елементів масиву.В
        методі Main створити масив з 10 елементів і викликати
        GenArray, передати в нього масив як параметр.Результат
        вивести на консоль.*/

    static void GenArray(int[] mas)
    {
        Random rnd = new Random(); //викликаємо метод Random та записуємо його в змінну rnd
        for (int i = 0; i < mas.Length; i++)//створюємо цикл за проходження по кожному елементу массиву
        {
            mas[i] = rnd.Next(0, 10); //для кожного єлементу массиву просвоюємо рандомне значення 
            Console.Write(mas[i] + ", ");//виводимо значення єлементу массиву в консоль
        }
        Console.WriteLine();

        double med = Medium(mas); //створюємо змінну med і записуємо в неї метод для обчислення сер.ариф.
        Console.WriteLine($"Середнє арифметичне массиву: {med}");

        double Medium(int[] mas) //метод для обчислення сер.ариф.
        {
            int sum = 0; //змінна для запису сумми массиву
            for (int i = 0; i < mas.Length; i++) //проходимо циклом по кождому єлементу массиву
            {
                sum += mas[i];//добавляємо значення єлементу массиву до сумми
            }
        return (double)sum / mas.Length; //ділимо сумму значень массиву на кількість єлементів та повертаємо результат
     }
    }
    private static void Main(string[] args)
    {
        int[] mas = new int[10];//строрюємо массив на 10 єлементів 
        GenArray(mas);//викликаємо метод GetArray та передаємо в параметри массив
    }
}
